[
  {
    "name": "갤럭시 S24",
    "category": "전자제품",
    "price": 1200000,
    "stock": 50,
    "image_url": "/images/galaxy_s24.jpg",
    "description": "삼성전자의 2024년 플래그십 스마트폰 갤럭시 S24입니다. 6.2인치 Dynamic AMOLED 2X 디스플레이를 탑재하여 생생한 화질을 제공합니다. Snapdragon 8 Gen 3 프로세서로 강력한 성능을 자랑하며, AI 기반 사진 편집 기능이 탑재되어 있습니다. 50MP 광각 카메라, 12MP 초광각, 10MP 망원 카메라로 구성된 트리플 카메라 시스템을 갖추고 있습니다. 4000mAh 배터리로 하루 종일 사용 가능하며, 25W 급속 충전과 무선 충전을 지원합니다. IP68 등급의 방수방진 기능과 Gorilla Glass Victus 2로 내구성이 뛰어납니다. 8GB RAM과 256GB 저장공간을 기본 제공하며, 5G 네트워크를 완벽하게 지원합니다."
  },
  {
    "name": "아이폰 15 Pro",
    "category": "전자제품",
    "price": 1550000,
    "stock": 30,
    "image_url": "/images/iphone_15_pro.jpg",
    "description": "Apple의 프리미엄 스마트폰 아이폰 15 Pro입니다. 6.1인치 Super Retina XDR 디스플레이와 ProMotion 기술로 최대 120Hz 주사율을 지원합니다. A17 Pro 칩으로 업계 최고 수준의 성능을 제공하며, 티타늄 소재의 고급스러운 디자인이 특징입니다. 48MP 메인 카메라, 12MP 초광각, 12MP 망원 카메라로 구성된 Pro 카메라 시스템을 탑재했습니다. Action 버튼으로 다양한 기능을 빠르게 실행할 수 있으며, Dynamic Island로 알림과 실행 중인 활동을 직관적으로 확인할 수 있습니다. USB-C 포트를 채택하여 범용성이 향상되었고, 최대 29시간의 비디오 재생이 가능한 배터리를 탑재했습니다. iOS 17 운영체제로 최신 기능을 모두 사용할 수 있습니다."
  },
  {
    "name": "맥북 프로 M3",
    "category": "전자제품",
    "price": 2500000,
    "stock": 20,
    "image_url": "/images/macbook_pro_m3.jpg",
    "description": "Apple의 혁신적인 M3 칩을 탑재한 14인치 맥북 프로입니다. 3nm 공정의 M3 칩은 8코어 CPU와 10코어 GPU로 전문가급 성능을 제공합니다. Liquid Retina XDR 디스플레이는 14.2인치 크기에 3024x1964 해상도를 지원하며, ProMotion 기술로 최대 120Hz 주사율을 구현합니다. 최대 1600 nits의 피크 밝기로 HDR 콘텐츠를 생생하게 표현합니다. 16GB 통합 메모리와 512GB SSD를 기본 탑재하여 멀티태스킹과 대용량 파일 작업이 원활합니다. 최대 17시간의 배터리 사용 시간으로 외부에서도 오랜 시간 작업할 수 있습니다. Thunderbolt 4 포트 3개, HDMI 포트, SDXC 카드 슬롯, MagSafe 3 충전 포트를 제공합니다. 스튜디오급 마이크 어레이와 6스피커 사운드 시스템으로 전문적인 오디오 작업도 가능합니다."
  },
  {
    "name": "에어팟 프로 2세대",
    "category": "전자제품",
    "price": 350000,
    "stock": 100,
    "image_url": "/images/airpods_pro_2.jpg",
    "description": "Apple의 프리미엄 무선 이어폰 에어팟 프로 2세대입니다. 업그레이드된 H2 칩으로 이전 세대 대비 2배 향상된 액티브 노이즈 캔슬링 기능을 제공합니다. 적응형 투명 모드로 주변 소음을 지능적으로 조절하여 편안한 청취 경험을 선사합니다. 맞춤형 공간 음향과 다이내믹 헤드 트래킹으로 몰입감 있는 3D 오디오를 경험할 수 있습니다. IPX4 등급의 생활방수를 지원하여 운동 중에도 안심하고 사용 가능합니다. 단일 충전으로 최대 6시간 재생이 가능하며, 충전 케이스 사용 시 최대 30시간까지 사용할 수 있습니다. 4가지 크기의 실리콘 팁이 제공되어 완벽한 착용감을 찾을 수 있습니다. MagSafe와 무선 충전을 지원하는 충전 케이스에는 스피커가 내장되어 '나의 찾기'로 쉽게 위치를 파악할 수 있습니다."
  },
  {
    "name": "나이키 에어맥스",
    "category": "의류/신발",
    "price": 180000,
    "stock": 80,
    "image_url": "/images/nike_airmax.jpg",
    "description": "나이키의 아이코닉한 운동화 에어맥스입니다. 가시적인 Max Air 유닛이 뛰어난 쿠셔닝을 제공하여 장시간 착용해도 편안합니다. 통기성이 뛰어난 메시 소재의 갑피로 발을 시원하고 쾌적하게 유지합니다. 내구성 있는 고무 밑창은 다양한 지면에서 우수한 접지력을 제공합니다. 클래식한 디자인과 현대적인 감각이 조화를 이루어 운동뿐만 아니라 일상 착용에도 완벽합니다. 발목을 감싸는 패딩 처리로 안정감을 높였으며, 전통적인 레이스업 방식으로 발에 맞게 조절할 수 있습니다. 다양한 컬러웨이로 개성을 표현할 수 있으며, 러닝, 워킹, 트레이닝 등 다목적으로 활용 가능합니다. 정품 나이키 제품으로 품질을 보증합니다."
  },
  {
    "name": "아디다스 트레이닝복",
    "category": "의류/신발",
    "price": 120000,
    "stock": 60,
    "image_url": "/images/adidas_tracksuit.jpg",
    "description": "아디다스의 클래식 트레이닝복 세트입니다. 재킷과 팬츠로 구성된 풀 세트로, 운동과 일상 모두에 활용 가능합니다. 폴리에스터 소재로 제작되어 땀을 빠르게 흡수하고 배출하는 Climalite 기술이 적용되었습니다. 재킷은 풀집업 디자인에 지퍼 포켓 2개가 있어 소지품을 안전하게 보관할 수 있습니다. 아디다스의 시그니처인 3-스트라이프가 소매에 디자인되어 스포티한 감성을 더했습니다. 팬츠는 허리에 신축성 있는 밴드와 조절 가능한 드로우코드가 있어 편안한 착용감을 제공합니다. 발목 부분은 립 처리되어 활동 시 올라가는 것을 방지합니다. 레귤러 핏으로 활동성이 뛰어나며, 다양한 사이즈로 구성되어 있습니다. 세탁이 간편하고 형태가 잘 유지되어 오래 착용할 수 있습니다."
  },
  {
    "name": "무선 키보드",
    "category": "컴퓨터 주변기기",
    "price": 89000,
    "stock": 45,
    "image_url": "/images/wireless_keyboard.jpg",
    "description": "블루투스 기계식 무선 키보드입니다. 청축 스위치를 사용하여 명확한 타건감과 클릭음을 제공하며, 타이핑의 즐거움을 극대화합니다. 블루투스 5.0 기술로 최대 3개의 기기와 동시에 페어링하여 버튼 하나로 간편하게 전환할 수 있습니다. 컴팩트한 텐키리스 디자인으로 책상 공간을 절약하고 휴대성도 뛰어납니다. 충전식 내장 배터리로 한 번 충전으로 최대 3개월 사용 가능합니다. RGB 백라이트는 16가지 조명 효과를 지원하며 밝기 조절이 가능합니다. 알루미늄 상판으로 고급스러운 외관과 내구성을 동시에 갖추었습니다. 윈도우, 맥OS, 안드로이드, iOS 등 다양한 운영체제와 호환됩니다. 안티 고스팅 기능으로 여러 키를 동시에 눌러도 정확하게 인식합니다. 높이 조절 가능한 받침대로 편안한 타이핑 각도를 설정할 수 있습니다."
  },
  {
    "name": "로지텍 마우스",
    "category": "컴퓨터 주변기기",
    "price": 65000,
    "stock": 70,
    "image_url": "/images/logitech_mouse.jpg",
    "description": "로지텍의 고성능 무선 게이밍 마우스입니다. HERO 25K 센서를 탑재하여 최대 25,600 DPI의 정밀한 트래킹을 제공합니다. LIGHTSPEED 무선 기술로 유선과 동일한 1ms의 응답 속도를 구현하여 게임에서 우위를 점할 수 있습니다. POWERPLAY 무선 충전 시스템과 호환되어 사용 중에도 충전이 가능합니다. RGB LIGHTSYNC 기술로 약 1,680만 가지 컬러를 표현하며, 게임이나 오디오와 동기화할 수 있습니다. 11개의 프로그래밍 가능한 버튼으로 매크로와 단축키를 설정하여 효율성을 높일 수 있습니다. 인체공학적 디자인으로 장시간 사용해도 손목의 피로가 적습니다. 온보드 메모리에 최대 5개의 프로필을 저장하여 어느 컴퓨터에서나 설정을 유지할 수 있습니다. 단일 충전으로 최대 60시간 사용 가능하며, 빠른 충전 기능으로 5분 충전 시 2.5시간 사용할 수 있습니다."
  },
  {
    "name": "삼성 모니터 27인치",
    "category": "전자제품",
    "price": 450000,
    "stock": 25,
    "image_url": "/images/samsung_monitor.jpg",
    "description": "삼성의 27인치 4K UHD 모니터입니다. 3840x2160 해상도로 선명하고 디테일한 화면을 제공합니다. IPS 패널을 사용하여 178도의 광시야각과 정확한 색재현을 구현했습니다. HDR10을 지원하여 밝은 부분과 어두운 부분의 디테일을 모두 살려 생생한 영상을 표현합니다. AMD FreeSync 기술로 화면 찢어짐과 끊김 현상을 최소화하여 부드러운 게이밍 경험을 제공합니다. 플리커 프리와 블루라이트 저감 기능으로 장시간 사용 시 눈의 피로를 줄입니다. 베젤리스 3면 디자인으로 멀티 모니터 구성 시 몰입감을 극대화합니다. 높이, 기울기, 회전 조절이 가능한 스탠드로 최적의 시청 위치를 설정할 수 있습니다. HDMI 2.0 2개, DisplayPort 1개, USB 허브 기능을 제공하여 다양한 기기와 연결 가능합니다. 5ms의 응답 속도와 60Hz 주사율로 일반 사무 작업부터 게임까지 다목적으로 활용할 수 있습니다."
  },
  {
    "name": "LG 냉장고",
    "category": "가전제품",
    "price": 1800000,
    "stock": 15,
    "image_url": "/images/lg_refrigerator.jpg",
    "description": "LG전자의 프리미엄 양문형 냉장고 800L 용량입니다. 인버터 리니어 컴프레서를 탑재하여 뛰어난 냉각 성능과 에너지 효율을 동시에 구현했습니다. 1등급 에너지 효율로 전기료를 절감할 수 있습니다. 도어 인 도어 시스템으로 자주 사용하는 식품은 문을 완전히 열지 않고도 꺼낼 수 있어 냉기 손실을 최소화합니다. 선형냉각 시스템으로 냉장고 내부 온도 편차를 ±0.5도 이내로 유지하여 식품을 신선하게 보관합니다. 신선도 UP 서랍은 습도 조절 기능으로 채소와 과일을 더 오래 신선하게 보존합니다. 급속 냉동 기능으로 식재료의 영양소 손실을 최소화합니다. 스테인리스 스틸 외관으로 고급스러우며 지문이 잘 묻지 않는 코팅 처리되어 있습니다. LED 조명이 냉장고 내부를 밝게 비춰 식품을 쉽게 찾을 수 있습니다. 야채 탈취 시스템으로 냉장고 내부를 항상 청결하게 유지합니다. 스마트 진단 기능으로 스마트폰으로 냉장고 상태를 확인하고 문제 발생 시 빠르게 대응할 수 있습니다."
  }
]